---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralConnectionType
source: html/77ba8b36-37a2-0e11-409b-cb24b260a795.htm
---
# StructuralConnectionType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.